{
  "architectures": [
    "GAUAlphaForMaskedLM"
  ],
  "attention_key_size": 128,
  "attention_probs_dropout_prob": 0.1,
  "attention_scale": true,
  "classifier_dropout": 0.1,
  "embedding_size": 768,
  "gradient_checkpointing": false,
  "hidden_act": "swish",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "gau_alpha",
  "normalization": "softmax_plus",
  "num_hidden_layers": 24,
  "pad_token_id": 0,
  "torch_dtype": "float32",
  "transformers_version": "4.17.0",
  "type_vocab_size": 2,
  "use_bias": false,
  "vocab_size": 12000
}
